{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello, I'm here to listen. What's on your mind today?",
        "Hi there, feel free to share your thoughts with me.",
        "Greetings! How can I assist you today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "Take care, see you soon!",
        "Goodbye! I'm here whenever you need to talk.",
        "Farewell, and remember that I'm here to help."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Can you help me with my problem?",
        "I need help with an issue."
      ],
      "responses": [
        "I'm here to help. Could you explain a bit more about what you're dealing with?",
        "It sounds like you're facing a challenge. What do you think would be a good first step?"
      ]
    },
    {
      "tag": "unhappiness",
      "patterns": [
        "I am unhappy with my relationship",
        "My relationship makes me sad"
      ],
      "responses": [
        "It sounds tough. What do you think makes you feel this way about your relationship?",
        "That must be hard. What do you need from your relationship that you feel is lacking now?"
      ]
    },
    {
      "tag": "career",
      "patterns": [
        "Should I quit my job?",
        "I hate my job",
        "I'm thinking of resigning"
      ],
      "responses": [
        "It's important to feel fulfilled by what you do. What aspects of your job are making you consider quitting?",
        "Quitting is a big decision. What would your ideal work situation look like?"
      ]
    },
    {
      "tag": "exploration",
      "patterns": [
        "What should I do?",
        "I don't know what to do",
        "I'm feeling lost"
      ],
      "responses": [
        "Let's try to find a way forward. What options have you considered so far?",
        "Feeling lost can be tough. What's one thing that feels right or positive to you now?"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Humor is a great way to lift our spirits. Why don't you tell me what makes you laugh?",
        "I find that laughter can be very therapeutic. What's something funny that happened to you recently?"
      ]
    }
  ]
}
